#+TITLE: Workbook
#+SETUPFILE: setup.org

* Functions Code 						   :noexport:
:PROPERTIES: 
:noweb-ref: Functions
:END: 

  Functions compatible with most spreadsheet software.
  
  |----------------------+-----------+-------+--------|
  | Category             | Completed | Total | % Done |
  |----------------------+-----------+-------+--------|
  | Date and Time        |        17 |    23 |  74.0% |
  | Engineering          |         2 |    51 |   4.0% |
  | Financial            |         8 |    31 |  26.0% |
  | Information          |        22 |    23 |  96.0% |
  | Logical              |         9 |     9 | 100.0% |
  | Lookup and Reference |        12 |    12 | 100.0% |
  | Math                 |        44 |    69 |  64.0% |
  | Stats                |         4 |    54 |   8.0% |
  | Text                 |        24 |    29 |  83.0% |
  |----------------------+-----------+-------+--------|
  | #                    |       123 |   227 |  55.0% |
  |----------------------+-----------+-------+--------|
  #+TBLFM: @2$4='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $2 ".0")) (string-to-number $3))))) "%")::@3$4='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $2 ".0")) (string-to-number $3))))) "%")::@4$4='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $2 ".0")) (string-to-number $3))))) "%")::@5$4='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $2 ".0")) (string-to-number $3))))) "%")::@6$4='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $2 ".0")) (string-to-number $3))))) "%")::@7$4='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $2 ".0")) (string-to-number $3))))) "%")::@8$4='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $2 ".0")) (string-to-number $3))))) "%")::@9$4='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $2 ".0")) (string-to-number $3))))) "%")::@10$4='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $2 ".0")) (string-to-number $3))))) "%")::@11$2=vsum(@4..10)::@11$3=vsum(@4..10)::@11$4='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $2 ".0")) (string-to-number $3))))) "%")
  
